# Day 3

# 5 different Ways to read Data From a list

### 1. Reading from a csv file

### Syntax : 
using read_csv('filename.csv')

### 2. Reading from a excel file

### Syntax : 
using read_excel('filename.excel','sheet1')

### 3. From Python Dictionaries

d = {
    'k1' : ['value1' , 'value2' ] , 
    'k2' : ['value1' , 'value2' ] , 
}

### Synatx :
#### using df = df.DataFrame(c)

### 4. From a list of  Tuples

t = 
[
   ('value1', 'value2'),
   (1,2),
   ('value1', 'value2')
]

### Synatx :
#### using df = df.DataFrame(t, columns = ['column_name1','column_name2','column_name3'])

### 5. From a list of Dictionary

In [2]:
import pandas as pd
weatherdata = [
    {'day': '2/3/2024' , 'temperature': 32, 'windespeed': 65},
    {'day': '3/3/2024' , 'temperature': 45, 'windespeed': 63},
    {'day': '5/3/2024' , 'temperature': 78, 'windespeed': 61}
]
df = pd.DataFrame(weatherdata)
df

        day  temperature  windespeed
0  2/3/2024           32          65
1  3/3/2024           45          63
2  5/3/2024           78          61

##  How to read and and weite in csv and excel file

In [28]:
import pandas as pd

In [29]:
df = pd.read_csv('stock_data.csv')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [30]:
df = pd.read_csv('stock_data.csv', skiprows  = 1)
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [31]:
df = pd.read_csv('stock_data.csv', header  = 1)
df

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [32]:
df = pd.read_csv('stock_data.csv', header = None , names = ['col1' ,'col2'  ,'col3' ,'col4' ,'col5' ])
df

      col1           col2     col3   col4           col5
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [33]:
df = pd.read_csv('stock_data.csv' , nrows = 3)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [34]:
df = pd.read_csv('stock_data.csv' , na_values = ['not available' , 'n.a.'])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [35]:
df = pd.read_csv('stock_data.csv' , na_values = ['not available' , 'n.a.'])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [36]:
df = pd.read_csv('stock_data.csv' , na_values = 
                {
                    'eps' : ['not available' , 'n.a.'],
                    'revenue' : ['not available' , 'n.a.' , -1],
                    'people' : ['not available' , 'n.a.'],
                    
                })
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [37]:
# writing to csv files

In [38]:
# it puts changes in the excel file

# while writing do not open same  excel file unless it will give permission denied error

In [39]:
df.to_csv('new.csv')

In [40]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [41]:
df.to_csv('new.csv' , index = False)

In [42]:
df.to_csv('new.csv' , index = False , header = False)

In [43]:
 df.to_csv('new.csv')

In [44]:
 df.to_csv('new.csv' , columns = ['tickers' , 'eps'])

##  Excel

In [45]:
# reading from excel
import pandas as pd

In [46]:
df = pd.read_excel('stock_data.xlsx')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [47]:
# df = pd.read_excel('stock_data.xlsx' , converters = {
#     'people' : convert_people_cell
# } )
# df

In [48]:
df = pd.read_excel('stock_data.xlsx')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [49]:
df = pd.read_excel('stock_data.xlsx')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [50]:
# writing to excel

df = df.to_excel('new.xlsx' , sheet_name = 'Stocks' , startrow = 1 , startcol = 2 , index = False)
df

In [51]:


# First DataFrame
df1 = pd.DataFrame({
                    'id': ['A01', 'A02', 'A03', 'A04'],
                    'Name': ['ABC', 'PQR', 'DEF', 'GHI']
                   })
 
# Second DataFrame
df2 = pd.DataFrame({
                    'id': ['B05', 'B06', 'B07', 'B08'],
                    'Name': ['XYZ', 'TUV', 'MNO', 'JKL']
                  })

with pd.ExcelWriter('df1_df2.xlsx') as writer :
    df1.to_excel(writer , sheet_name = 'df1')
    df2.to_excel(writer , sheet_name = 'df2')

In [54]:
# we can concatinate two DataFrames too

import pandas as pd
# First DataFrame
df1 = pd.DataFrame({'id': ['A01', 'A02', 'A03', 'A04'],
                    'Name': ['ABC', 'PQR', 'DEF', 'GHI']})
 
# Second DataFrame
df2 = pd.DataFrame({'id': ['B05', 'B06', 'B07', 'B08'],
                    'Name': ['XYZ', 'TUV', 'MNO', 'JKL']})
 
frames = [df1, df2]
 
result = pd.concat(frames)
display(result)

    id Name
0  A01  ABC
1  A02  PQR
2  A03  DEF
3  A04  GHI
0  B05  XYZ
1  B06  TUV
2  B07  MNO
3  B08  JKL